SetOColdFormed
Syntax
SapObject.SapModel.PropMaterial.SetOColdFormed
VB6 Procedure
Function SetOColdFormed(ByVal Name As String, ByVal Fy As Double, ByVal Fu As Double, ByVal SSHysType As Long, Optional ByVal Temp As Double = 0) As Long
Parameters
Name
The name of an existing cold formed material property.
Fy
The minimum yield stress. [F/L2]
Fu
The minimum tensile stress. [F/L2]
SSHysType
This is 0, 1 or 2, indicating the stress-strain hysteresis type.
0 = Elastic
1 = Kinematic
2 = Takeda
Temp
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
This item is the temperature at which the specified data applies. The temperature must have been defined previously for the material.
Remarks
This function sets the other material property data for cold formed materials.
The function returns zero if the data is successfully assigned; otherwise it returns a nonzero value.
VBA Example
Sub AssignMatPropColdFormedData()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'initialize new material property
 ret = SapModel.PropMaterial.SetMaterial("ColdFormed", MATERIAL_COLDFORMED)
 'assign other properties
 ret = SapModel.PropMaterial.SetOColdFormed("ColdFormed", 52, 67, 1)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.02.
See Also
GetOColdFormed